##########定义,特点,常用操作
#列表可以修改.但是元组不能修改,和封装一样
#定义元组字面量(元素,元素,元素,元素)
#定义元组变量
#变量名称=(元素,元素.元素)
#定义空元组
#变量名称=()
#变量名称=tuple() #元组的类对象
yuan1=('星痕','无畏','清融','久酷',666,True,'无畏','久酷','久酷')
yuan2=()
yuan3=tuple()

print(f"yuan1的类型是{type(yuan1)},yuan1的内容是:{yuan1}")
#定义单个元素的元组时候元素后加个逗号
yuan4=(666,)#加了逗号才叫元组


#元组嵌套:
yuan5=((1,2,3),(46,7,6))
print(yuan5[0][2])

#下标索引取出元组里的内容:
num = yuan5[0][2]
print(f"从嵌套元组中取出的数字是:{num}")


"""
index() 查找某个数值如果有那就返回下标
count()统计某个数据在当前元组中出现的次数
len(元组)统计元组中元素的个数
"""
x=yuan1.index('清融')
print(f"yuan1中'清融'在第{x}位")

y=yuan1.count('久酷')
print(f"元组中'久酷'出现的次数:{y}")
z=len(yuan1)
print(f"元组中一共有{z}个元素")


#元组的遍历
#while的遍历
a=0
while a<len(yuan1):
    print(f"元组中的元素有:{yuan1[a]}")
    a+=1
#############################
print()
#for的遍历
i=0
for i in yuan1:
    print(f"for情况下元组中的元素有:{i}")#这个i直接表现了元素

#####################但是元组如果嵌套了一个列表,列表里的东西就又可以修改了
x1=((1,2,3),[4,5,6])
x1[1][2]=666
print(x1)






